### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # cloudflare_api_token.pages_api_token will be created
+   resource "cloudflare_api_token" "pages_api_token" {
+       id          = (known after apply)
+       issued_on   = (known after apply)
+       modified_on = (known after apply)
+       name        = "pages-api-token"
+       status      = (known after apply)
+       value       = (sensitive value)

+       policy {
+           effect            = "allow"
+           permission_groups = [
+               "b05b28e839c54467a7d6cba5d3abb5a3",
            ]
+           resources         = {
+               "com.cloudflare.api.account.*" = "*"
            }
        }
    }

  # cloudflare_pages_project.seichi_portal will be updated in-place
!   resource "cloudflare_pages_project" "seichi_portal" {
        id                = "seichi-portal"
        name              = "seichi-portal"
        # (5 unchanged attributes hidden)



!       source {
            # (1 unchanged attribute hidden)

!           config {
!               preview_branch_includes       = [
-                   "*",
                ]
                # (8 unchanged attributes hidden)
            }
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>